{
  "backend/main.mo": "Defines data types, authorization helpers, and state maps for clients, trainers, workouts, logs, and bookings, including admin and trainer password checks.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected files, components, and test IDs for admin UI and login flow updates.",
  "frontend-file-summaries.txt": "Provides high‑level summaries for various frontend files describing their roles across login, dashboards, components, and hooks.",
  "frontend/CUSTOM_DOMAIN.md": "Documentation explaining how to configure a custom domain for the Internet Computer app via DNS and the ic-domains file.",
  "frontend/index.css": "Tailwind base/theme variable definitions for light and dark modes using OKLCH color values.",
  "frontend/index.html": "HTML entry point containing the root div and script loader for the React app.",
  "frontend/public/.well-known/ic-domains": "Declares the allowed custom domains for the Internet Computer deployment.",
  "frontend/src/App.tsx": "Main React component controlling authentication state, navigation between views, and session persistence for trainer, client, and admin flows.",
  "frontend/src/components/admin/PersonnelTable.tsx": "Admin table component displaying trainer personnel data with columns for first name, last name, and PT code.",
  "frontend/src/components/client/AppointmentsSection.tsx": "Form for clients to request appointments and view confirmed ones, with validation and mutation handling.",
  "frontend/src/components/client/AssignedWorkoutsSection.tsx": "Displays a client's assigned workouts, handles loading states, and allows saving workout completions.",
  "frontend/src/components/client/CompilableAssignedWorkoutCard.tsx": "Interactive card for logging completed workout details with validation and save handling.",
  "frontend/src/components/client/WorkoutLogsSection.tsx": "Lists and sorts a client's workout history, showing completion status and details.",
  "frontend/src/components/client/WorkoutRunnerOverlay.tsx": "Placeholder component file with no implemented content.",
  "frontend/src/components/client/WorkoutRunnerScreen.tsx": "Guided workout runner displaying exercises with navigation and rest timer support.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component rendering a fallback UI with reload support when runtime errors occur.",
  "frontend/src/components/trainer/BodyweightProgressionChart.tsx": "Shows bodyweight trends over time with summary stats and a simple visual chart.",
  "frontend/src/components/trainer/BookingUpsertDialog.tsx": "Dialog component for creating or editing a booking, managing form state, validation, and API mutations.",
  "frontend/src/components/trainer/ClientWorkoutsList.tsx": "Displays a list of workouts with exercises and allows optional editing of a selected workout.",
  "frontend/src/components/trainer/ExercisePerformanceProgression.tsx": "Shows searchable, grouped exercise performance history with comparisons between first and latest records.",
  "frontend/src/components/trainer/TrainerBookingsCalendar.tsx": "Monthly calendar displaying bookings, allowing day selection and opening dialogs to create or edit bookings.",
  "frontend/src/components/trainer/TrainerClientDetailSections.tsx": "Tabbed client detail view handling height, weight, exercise progress, and workout management.",
  "frontend/src/components/trainer/WorkoutBuilder.tsx": "React form component for creating or editing workouts, handling exercises, set weights, rest times, and submission via query hooks.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useCountdownTimer.ts": "Reusable countdown timer hook supporting start, pause, reset, and tracking completion.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, stored identities, and related UI state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for admin, trainer, and client operations.",
  "frontend/src/index.css": "Tailwind CSS base with custom design tokens for light and dark themes.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page showing platform stats and trainer lists using data from query hooks.",
  "frontend/src/pages/AdminLoginPage.tsx": "Admin login form with client-side code check and mutation to authenticate the admin.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Client dashboard handling workout logging, assigned workouts, workout runner, and progress management.",
  "frontend/src/pages/ClientLoginPage.tsx": "Client login screen validating username and PT code using backend actor authentication.",
  "frontend/src/pages/DashboardPage.tsx": "Trainer dashboard displaying PT code, client list, client details, scheduling, and profile/email updates.",
  "frontend/src/pages/LoginPage.tsx": "Trainer login page that authenticates via access code and provides navigation to client and admin login flows.",
  "frontend/src/pages/RegistrationPage.tsx": "React registration form that validates inputs, calls backend actor methods to register/authenticate a client, and maps errors to user-friendly messages.",
  "frontend/src/utils/bookingTime.ts": "Utility helpers for converting, formatting, and computing durations for booking-related Date and time values.",
  "frontend/src/utils/trainerAuthErrors.ts": "Parses raw trainer authentication errors and maps them to deterministic, user-friendly English messages.",
  "frontend/src/utils/urlParams.ts": "Functions for reading, persisting, and clearing URL parameters using both query strings and sessionStorage.",
  "frontend/src/utils/userFacingErrors.ts": "Normalizes backend errors into readable user-facing messages and provides error extraction and logging helpers.",
  "frontend/src/utils/workoutRestTimes.ts": "Utilities for validating, normalizing, formatting, and converting per-set rest times in workouts.",
  "frontend/src/utils/workoutSetWeights.ts": "Utilities for normalizing, validating, formatting, and converting per-set workout set weights.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, animations, and plugins.",
  "project_state.json": "Project state metadata describing features, new requests, and configuration for an admin dashboard project."
}