{
  "backend/main.mo": "Defines the backend actor with user authentication, trainer authorization, workout/client data models, and storage maps for profiles, workouts, logs, and trainer codes.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, descriptions, related frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each major frontend file’s role, focusing on login flows, dashboards, workout management, and UI components.",
  "frontend/CUSTOM_DOMAIN.md": "Guide explaining how to configure custom domains for the Internet Computer using DNS and the ic-domains file.",
  "frontend/index.css": "Tailwind base/theme configuration using OKLCH variables for light and dark modes with fitness‑themed colors.",
  "frontend/index.html": "Base HTML entry point that loads the React application via main.tsx.",
  "frontend/public/.well-known/ic-domains": "Lists approved custom domains for the deployed frontend.",
  "frontend/src/App.tsx": "Main React app managing auth state, routing between views, session persistence, and providers for themes and React Query.",
  "frontend/src/components/client/AssignedWorkoutsSection.tsx": "Client dashboard section that lists assigned workouts, supports logging completion, and launches the workout runner overlay.",
  "frontend/src/components/client/CompilableAssignedWorkoutCard.tsx": "Form component for clients to enter actual sets, reps, weight, validate inputs, and save a workout log.",
  "frontend/src/components/client/WorkoutLogsSection.tsx": "Displays a client’s workout history with loading state, sorting, and log details.",
  "frontend/src/components/client/WorkoutRunnerOverlay.tsx": "Fullscreen workout runner with exercise navigation and countdown rest timer.",
  "frontend/src/components/trainer/BodyweightProgressionChart.tsx": "Shows bodyweight trends with summary stats and a simple visual progression chart.",
  "frontend/src/components/trainer/ClientWorkoutsList.tsx": "Renders a trainer’s list of client workouts with exercise details and optional editing.",
  "frontend/src/components/trainer/ExercisePerformanceProgression.tsx": "Displays exercise performance grouped by exercise with search filtering and progression stats.",
  "frontend/src/components/trainer/TrainerClientDetailSections.tsx": "Renders client info, progress charts, and workout tools with mutations for height, weight, and workout management.",
  "frontend/src/components/trainer/WorkoutBuilder.tsx": "Provides a form to create or edit workouts, handling exercises, validation, and submission to backend mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useCountdownTimer.ts": "Implements a simple countdown timer hook with start, pause, reset, and completion tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and managing login/logout state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating client, trainer, workout, and metric data using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables for themes, colors, and layout across light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Client dashboard showing assigned workouts, progress logs, and a form to add workout progress using client-specific queries.",
  "frontend/src/pages/ClientLoginPage.tsx": "Client login page handling username and PT code authentication with detailed error mapping.",
  "frontend/src/pages/DashboardPage.tsx": "Trainer dashboard displaying PT code, client list, client details, and tools for editing client info and settings.",
  "frontend/src/pages/LoginPage.tsx": "Trainer login page that authenticates via access code and maps backend errors to user-friendly messages.",
  "frontend/src/pages/RegistrationPage.tsx": "Client registration form validating username and PT code, registering the user, and auto‑authenticating on success.",
  "frontend/src/utils/trainerAuthErrors.ts": "Utility for extracting raw error messages and mapping trainer authentication errors to user-friendly text.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL and hash parameters, storing them in sessionStorage, and syncing persisted values. Also includes utilities to remove parameters from the hash.",
  "frontend/src/utils/workoutRestTimes.ts": "Utilities to normalize, validate, format, and convert per‑set rest time values for workouts. Ensures rest times match set counts and are valid integers.",
  "frontend/src/utils/workoutSetWeights.ts": "Functions for normalizing, validating, formatting, and converting per‑set weight values. Supports padding/truncation and bigint conversion for backend use.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, typography, container queries, animations, and component styling extensions.",
  "project_state.json": "Project state file describing current requirements, known issues, and features related to fixing trainer login reliability and error handling."
}