{
  "backend/main.mo": "Defines all backend data types and maps for clients, workouts, logs, trainers, and bookings, with initial access control and authentication helpers.",
  "feature_evidence.json": "Lists feature evidence entries mapping UI color‑theme work to specific files, components, and requirement IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of major frontend files and components for reference or documentation.",
  "frontend/CUSTOM_DOMAIN.md": "Markdown guide explaining how to configure custom domains for the Internet Computer app, including DNS and domain declaration steps.",
  "frontend/index.css": "Global Tailwind/OKLCH stylesheet defining light and dark CSS variables and applying base theme tokens.",
  "frontend/index.html": "HTML entry point enforcing light mode via meta and script, loading the React app root.",
  "frontend/public/.well-known/ic-domains": "Lists approved custom domains for the deployed Internet Computer frontend.",
  "frontend/src/App.tsx": "Main React app controlling authentication flow, view routing, session persistence, and enforced light‑theme behavior.",
  "frontend/src/components/admin/PersonnelTable.tsx": "Admin table component displaying registered trainer identities with fallback UI when empty.",
  "frontend/src/components/client/AppointmentsSection.tsx": "Appointment request form that validates inputs, submits a mutation, and displays confirmed appointments and status messages.",
  "frontend/src/components/client/AssignedWorkoutsSection.tsx": "Fetches and displays assigned workouts, showing loading and empty states and allowing users to log workout completion.",
  "frontend/src/components/client/CompilableAssignedWorkoutCard.tsx": "Renders a workout card where clients input sets, reps, and weight, validates entries, and saves a workout log.",
  "frontend/src/components/client/WorkoutLogsSection.tsx": "Displays sorted workout logs with completion status and loading/empty states.",
  "frontend/src/components/client/WorkoutRunnerOverlay.tsx": "Placeholder file with no implemented content.",
  "frontend/src/components/client/WorkoutRunnerScreen.tsx": "Interactive workout runner that guides users through exercises with timers, navigation, and exercise details.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component showing a styled fallback UI with reload option when runtime errors occur.",
  "frontend/src/components/trainer/BodyweightProgressionChart.tsx": "Shows bodyweight trends over time with summary stats and a simple visual chart.",
  "frontend/src/components/trainer/BookingUpsertDialog.tsx": "Form dialog for creating or editing bookings with validation and time handling.",
  "frontend/src/components/trainer/ClientWorkoutsList.tsx": "Displays a client’s workouts with exercise details and optional edit actions.",
  "frontend/src/components/trainer/ExercisePerformanceProgression.tsx": "Shows exercise performance history grouped by exercise with search filtering and progression comparison.",
  "frontend/src/components/trainer/TrainerBookingsCalendar.tsx": "Monthly bookings calendar allowing day selection and booking creation or editing via a dialog.",
  "frontend/src/components/trainer/TrainerClientDetailSections.tsx": "Tabbed client detail view handling height, weight, performance history, and workout management.",
  "frontend/src/components/trainer/WorkoutBuilder.tsx": "Form component for creating or editing workouts, managing exercises, sets, weights, and rest times with mutation hooks.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useCountdownTimer.ts": "Reusable countdown timer hook providing start, pause, reset, and completion state for exercises.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, stored identities, and auth client lifecycle.",
  "frontend/src/hooks/useQueries.ts": "React Query wrappers for backend calls including admin, trainer, client auth, and workout-related operations.",
  "frontend/src/index.css": "Tailwind base styles and custom light color theme variables for the app.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page that verifies admin access and displays trainer and overview data with error and loading states.",
  "frontend/src/pages/AdminLoginPage.tsx": "Renders the admin login screen, handling authentication via a mutation and showing errors or loading states. Provides navigation back to the main login page.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Displays the client dashboard with progress logs, assigned workouts, workout runner, and forms to add workout progress. Manages workout editing, running, and server mutations for progress submission.",
  "frontend/src/pages/ClientLoginPage.tsx": "Provides client login with username and PT code, validating input and authenticating via backend actor. Handles error messages and navigation to registration or trainer login.",
  "frontend/src/pages/DashboardPage.tsx": "Implements the trainer dashboard showing PT code, clients list, client details, booking calendar, and settings for email, PT code, and identity. Supports multiple update mutations and related UI states.",
  "frontend/src/pages/LoginPage.tsx": "Trainer login page that authenticates using an access code via backend actor, with error handling and navigation to client or admin login.",
  "frontend/src/pages/RegistrationPage.tsx": "Client registration page validating username and PT code, registering the user, auto-authenticating on success, and handling detailed error messages. Includes input for optional email or nickname.",
  "frontend/src/utils/bookingTime.ts": "Utility functions for building, formatting, and converting Date objects and backend nanosecond time values.",
  "frontend/src/utils/trainerAuthErrors.ts": "Parses various trainer auth errors and maps them to deterministic, user-friendly English messages.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from hash-based routes.",
  "frontend/src/utils/userFacingErrors.ts": "Normalizes backend errors into user-friendly messages and extracts/logs raw error details.",
  "frontend/src/utils/workoutRestTimes.ts": "Handles per-set rest times including normalization, validation, formatting, and bigint conversion.",
  "frontend/src/utils/workoutSetWeights.ts": "Manages per-set workout weights with normalization, validation, formatting, and bigint conversion.",
  "frontend/tailwind.config.js": "Tailwind config extending colors, animations, and layout settings using custom CSS variables and plugins.",
  "project_state.json": "JSON file describing project state, known issues, and feature requests for restoring the original color palette."
}