{
  "backend/main.mo": "Main canister with authorization, client/workout data models, maps for storing users and workouts, and utility/query functions for trainer-client operations.",
  "backend/migration.mo": "Module defining old/new data types and migration logic to convert single-weight exercise fields into per-set weight arrays across stored entities.",
  "feature_evidence.json": "Feature evidence report mapping features to frontend files, components, and test IDs for per-set weight UI updates and workout display changes.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing authentication, dashboards, trainer/client components, and workout-related UI features.",
  "frontend/index.css": "Tailwind-based global theme variables and styles defining light/dark color palettes and component defaults.",
  "frontend/index.html": "Base HTML document mounting the React app and loading the main client script.",
  "frontend/src/App.tsx": "Root React component managing authentication, view switching between trainer/client flows, and global React Query and theme providers.",
  "frontend/src/components/client/AssignedWorkoutsSection.tsx": "Fetches and displays assigned workouts for a client, showing loading, empty state, and a list of editable workout cards.",
  "frontend/src/components/client/CompilableAssignedWorkoutCard.tsx": "Renders a form for completing a workout, validating exercise inputs, building a WorkoutLog, and submitting it.",
  "frontend/src/components/client/WorkoutLogsSection.tsx": "Displays a client's workout history with loading and empty states, sorting logs by date and showing completion status.",
  "frontend/src/components/trainer/BodyweightProgressionChart.tsx": "Shows bodyweight progression with summary stats and a simple bar-style visual chart based on sorted weight entries.",
  "frontend/src/components/trainer/ClientWorkoutsList.tsx": "Lists trainer-created workouts with exercise details, handling an empty state and showing per-set or single-set weights.",
  "frontend/src/components/trainer/ExercisePerformanceProgression.tsx": "Groups exercise performance records by exercise name, supports search filtering, and displays first vs latest performance metrics.",
  "frontend/src/components/trainer/TrainerClientDetailSections.tsx": "UI for trainers to view and edit client info, track bodyweight and exercise progress, and manage workouts via tabs.",
  "frontend/src/components/trainer/WorkoutBuilder.tsx": "Form component that builds and validates workouts with exercises, sets, reps, and per‑set weights, then submits them to the backend.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication, handling login, stored identity loading, status tracking, and context access.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating client data, workouts, bodyweight, height, and trainer-related info via the actor.",
  "frontend/src/index.css": "Tailwind base setup defining theme variables for light and dark modes and applying global background and text styles.",
  "frontend/src/main.tsx": "App entry point that initializes React, wraps it with query and identity providers, and loads global styles.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Client dashboard that displays assigned workouts, progress logs, and a form to add workout progress with validation and backend mutations.",
  "frontend/src/pages/ClientLoginPage.tsx": "Client login page handling username and PT code authentication with error mapping and navigation to registration or trainer login.",
  "frontend/src/pages/DashboardPage.tsx": "Trainer dashboard showing PT code, client list, client details, and email editing with related backend queries and mutations.",
  "frontend/src/pages/LoginPage.tsx": "Trainer login page validating an access code via backend authentication with detailed error parsing and messaging.",
  "frontend/src/pages/RegistrationPage.tsx": "Client registration page handling username, PT code, and optional email, performing backend registration and auto-login on success.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL or hash params, persisting them in sessionStorage, and clearing them from the hash.",
  "frontend/src/utils/workoutSetWeights.ts": "Utilities to normalize, validate, format, detect, and convert per‑set workout weights.",
  "frontend/tailwind.config.js": "Tailwind config defining theme extensions, color tokens, animations, and plugins.",
  "project_state.json": "Project metadata describing app features, versions, and current functional capabilities."
}