{
  "backend/main.mo": "Motoko backend actor defining client, workout, booking, and authentication data models with trainer/client access control and various state maps.",
  "feature_evidence.json": "Feature evidence report listing two CSS theming updates for light-mode beige/black styling and aligned accent tokens.",
  "frontend-file-summaries.txt": "JSON-style mapping summarizing main frontend files and components including pages, hooks, and trainer/client UI modules.",
  "frontend/CUSTOM_DOMAIN.md": "Guide explaining how to configure and deploy custom DNS domains for the Internet Computer app.",
  "frontend/index.css": "Tailwind base CSS defining light and dark OKLCH theme tokens for backgrounds, text, borders, and UI accents.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/public/.well-known/ic-domains": "Domain declaration file listing allowed custom domains for the IC canister.",
  "frontend/src/App.tsx": "Top-level React component managing trainer/client auth state, view routing, and session persistence.",
  "frontend/src/components/client/AppointmentsSection.tsx": "Provides UI and form logic for clients to request appointments and view confirmed ones, including validation and submission handling.",
  "frontend/src/components/client/AssignedWorkoutsSection.tsx": "Fetches and displays assigned workouts for a client, with ability to start, edit, and save workout logs.",
  "frontend/src/components/client/CompilableAssignedWorkoutCard.tsx": "Renders a single workout card allowing clients to input actual sets, reps, and weights, validate entries, and submit a workout log.",
  "frontend/src/components/client/WorkoutLogsSection.tsx": "Displays a scrollable list of completed workout logs sorted by date, with loading and empty states.",
  "frontend/src/components/client/WorkoutRunnerOverlay.tsx": "Empty placeholder component for workout runner overlay functionality.",
  "frontend/src/components/client/WorkoutRunnerScreen.tsx": "Implements a guided workout execution screen with exercise navigation and a rest timer using a countdown hook.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component displaying a styled fallback UI with reload option when runtime errors occur.",
  "frontend/src/components/trainer/BodyweightProgressionChart.tsx": "Shows bodyweight progress over time with summary statistics and a simple visual bar chart.",
  "frontend/src/components/trainer/BookingUpsertDialog.tsx": "Form dialog for creating, editing, and deleting bookings with validation and time calculations.",
  "frontend/src/components/trainer/ClientWorkoutsList.tsx": "Displays a list of client workouts with exercises, weights, rest times, and optional edit actions.",
  "frontend/src/components/trainer/ExercisePerformanceProgression.tsx": "Shows exercise performance history grouped by exercise with search filtering and progression comparison.",
  "frontend/src/components/trainer/TrainerBookingsCalendar.tsx": "Monthly calendar view that loads bookings, displays daily entries, and opens a dialog for creating or editing bookings.",
  "frontend/src/components/trainer/TrainerClientDetailSections.tsx": "Tabbed client detail view allowing height/weight updates, viewing progress charts, and managing workouts.",
  "frontend/src/components/trainer/WorkoutBuilder.tsx": "Form component for creating or editing workouts, handling exercises, weights, rest times, and submitting via mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useCountdownTimer.ts": "Reusable countdown timer hook providing start, pause, reset, and completion state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, stored identities, and auth client lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor methods for trainer, client, progress, and workout operations.",
  "frontend/src/index.css": "Tailwind CSS base setup defining theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Application entry initializing React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Client dashboard page showing progress, workouts, logs, and supporting workout creation, editing, and running.",
  "frontend/src/pages/ClientLoginPage.tsx": "Client login form handling username/PT code authentication, error mapping, and navigation callbacks.",
  "frontend/src/pages/DashboardPage.tsx": "Trainer dashboard showing PT code, client list/details, email editing, and password update functionality.",
  "frontend/src/pages/LoginPage.tsx": "Trainer login page that authenticates via access code and displays service or authentication errors.",
  "frontend/src/pages/RegistrationPage.tsx": "Client registration form validating username/PT code, submitting to backend, and auto-authenticating on success.",
  "frontend/src/utils/bookingTime.ts": "Utility functions for converting, formatting, and computing durations between date/time values including backend nanosecond timestamps.",
  "frontend/src/utils/trainerAuthErrors.ts": "Utilities for extracting and mapping trainer authentication errors into deterministic user-friendly messages.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL and sessionStorage parameters, supporting both query and hash routing.",
  "frontend/src/utils/userFacingErrors.ts": "Converts backend errors into user-friendly messages, extracts raw error text, and logs detailed error info.",
  "frontend/src/utils/workoutRestTimes.ts": "Normalizes, validates, formats, and converts per-set workout rest times for display and backend use.",
  "frontend/src/utils/workoutSetWeights.ts": "Handles normalization, validation, formatting, and bigint conversion of per-set workout target weights.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, existing features, pending requests, and configuration for the beige light-theme update project."
}