{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore original white + beige/brown light theme and disable dark styling",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Restore the original light theme palette (white background with beige/brown accents) via theme tokens so all Tailwind/shadcn styling reflects it consistently.",
      "acceptanceCriteria": [
        "The app background renders as white (or near-white) across all pages (trainer, client, admin) without any dark/black theme appearance.",
        "Primary/accent UI elements (e.g., buttons, icons, gradient badges) use a beige/brown palette rather than blue/purple or dark-mode colors.",
        "Theme tokens in `frontend/src/index.css` are updated so Tailwind/shadcn components consistently reflect the white + beige/brown palette (background, primary, secondary, muted, accent, border, ring)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update the light theme CSS variables to a white background with beige/brown (light brown) accents, ensuring key tokens (background/foreground/card/popover/primary/secondary/muted/accent/border/input/ring and any chart tokens used in gradients) align to the restored palette and propagate through Tailwind/shadcn token usage."
        },
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "Align the root-level Tailwind theme variable definitions with the restored white + beige/brown palette to avoid inconsistent token sources during build/dev, keeping background near-white and primary/accent in beige/brown."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Eliminate remaining dark-theme styling so the UI cannot visually switch to a dark/black palette (including under OS dark mode).",
      "acceptanceCriteria": [
        "With OS-level dark mode enabled, the app still renders with the same white + beige/brown palette.",
        "There are no pages/components that render with dark background/foreground tokens due to a `.dark` class being applied or dark variables being active.",
        "No changes are required to any backend canisters or API behavior to achieve this."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Neutralize dark-mode styling by removing or overriding the `.dark` variable block so it no longer defines a dark palette (set `.dark` variables to match `:root`), and ensure `color-scheme: light only` remains enforced for html/body so OS dark mode does not alter form controls or UA styling."
        },
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "Remove or neutralize the `.dark` theme variable overrides in this global stylesheet as well, preventing any dark token activation if a `.dark` class appears anywhere in the DOM."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Harden light-only rendering by configuring the existing `next-themes` ThemeProvider usage to fully ignore system theme changes (keep `forcedTheme=\"light\"` and disable system-driven switching), and add a small runtime guard that removes any accidental `dark` class from the root element on load."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Reinforce light-only behavior at the document level by ensuring the meta `color-scheme` remains `light only` and (if needed) adding a default light class/attribute to reduce any chance of dark UA styling when OS dark mode is enabled."
        }
      ]
    }
  ]
}