{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update light theme to beige background with black text",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Adjust light-mode surface and text CSS theme tokens in frontend/src/index.css (:root) to a beige-toned palette with black/near-black foreground for accessible contrast.",
      "acceptanceCriteria": [
        "In light mode, the page background and primary surfaces render in a beige tone (not pure white).",
        "In light mode, default text renders as black or near-black across pages (login, dashboard, client dashboard) with good readability.",
        "No UI areas remain unintentionally pure white due to theme tokens (except where explicitly intended, e.g., images)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update the :root light theme tokens for main surfaces and foreground text: set --background/--card/--popover/--sidebar to beige-toned OKLCH values (not pure white) and set --foreground/--card-foreground/--popover-foreground/--sidebar-foreground to black/near-black with accessible contrast. Keep the existing .dark token block unchanged."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Align light-mode interactive/accent tokens in frontend/src/index.css with the beige/black theme to preserve contrast for buttons, borders, inputs, rings, and muted/secondary surfaces without regressing dark mode.",
      "acceptanceCriteria": [
        "Primary buttons and their text have clear contrast in light mode (no low-contrast beige-on-beige or black-on-black combinations).",
        "Borders/inputs are visible but subtle on beige backgrounds in light mode.",
        "Dark mode appearance remains functionally unchanged (no regressions in readability or broken colors)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Refine light-mode interactive tokens in :root to match the beige/black theme while preserving usability: tune --primary/--primary-foreground, --secondary/--secondary-foreground, --muted/--muted-foreground, --accent/--accent-foreground, --border, --input, and --ring for clear contrast and subtle delineation on beige surfaces. Do not change .dark tokens unless a direct readability regression is identified during verification."
        }
      ]
    }
  ]
}